Revit 2026 API

# FaceTriangulate Method

---

Returns a triangular mesh approximation to the face.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Mesh Triangulate()
```
```vb
Public Function Triangulate As Mesh
```
```cpp
public:
Mesh^ Triangulate()
```
```fsharp
member Triangulate : unit -> Mesh
```

#### Return Value

Mesh

Tolerance of approximation is defined internally by Revit to be adequate for display purposes.

#### Reference

Face Class

Triangulate Overload

Autodesk.Revit.DB Namespace